services/load-balancer.yml
config:
  target: "http://river-river-ELGJ26U092IB-73907299.us-east-1.elb.amazonaws.com"
  phases:
    - duration: 200
      arrivalRate: 100
      name: "high load"

scenarios:
  - name: "Clients join a room"
    engine: "socketio"
    flow:
      - emit:
          channel: "room-join"
          data: "one"
      - think: 600
      - emit:
          channel: "room-join"
          data: "two"