services/load-balancer.yml
config:
  target: "http://river-river-a9gbrkugy0c4-1861874721.us-east-1.elb.amazonaws.com/"
  phases:
    - duration: 200
      arrivalRate: 100
      name: "high load"

scenarios:
  - name: "Clients join a room"
    engine: "socketio"
    flow:
      - emit:
          channel: "room-join"
          data: "one"
      - think: 120
      - emit:
          channel: "room-join"
          data: "two"