services/load-balancer.yml
config:
  target: "your river load balancer url"
  phases:
    - duration: 200
      arrivalRate: 50

scenarios:
  - name: "Clients join a room"
    engine: "socketio"
    flow:
      - emit:
          channel: "room-join"
          data: "one"
      - think: 600
      - emit:
        channel: "room-join"
        data: "two"